
# Задача 32: Определить индексы элементов массива (списка), значения 
# которых принадлежат заданному диапазону (т.е. не меньше заданного 
# минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 
#         0, -5, -5, 7]
# 5
# 15
# Вывод: [1, 9, 13, 14, 19]

a = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_el = 5
max_el = 15

res = []

for i in range(len(a)):
  if min_el <= a[i] <= max_el:
    res.append(i)

print(res) # [1, 9, 13, 14, 19]